anekdoty = [
"""День рождения старого, богатого еврея. Родственники его поздравляют...

— Соломон Маркович, здоровья, счастья и шоб Вы дожили аж до 100 лет!

— Таки мне сегодня 100!

— Ну, тогда хорошего Вам дня!""",
"""-В каких местах больнее всего бить тату?
-В местах лишения свободы.""",
"""Приехала бабка в Америку. По-английски ни слова. И вот ей захотелось манной каши. Приходит она в магазин,а там продавец черный.
Она подходит к нему и говорит:" дай манки".""",
"""Парень собирается на дискотеку в деревне…
Одеть есть что, а обуть нечего…
А у отца новые туфли есть, парадные… Лакированые…
В коробочке стоят для особого случая…
Ну он отца три часа упрашивал…
Короче выпросил… Приходит, модный весь такой… Подваливает к телке в миниюбке и говорит:"Хочешь угодаю какого цвета у тебя трусы?" Та:"Ну попробуй…" Он в свой туфель как в зеркало глядь и говорит:"Красные!"
Телка в шоке… Метнулась к подруге, рассказала все… Та предлагает:" А давай махнемся труселями…" Махнулись.
Девка опять к нему. «А сейчас угадаешь?!»
Ну Вася в туфлю…
И выдаёт: «Зеленые!» Девка снова в шоке. Рассказала все подруге.
Та :"А ты вообще сними трусы…"
Сняла и к парню. «А сейчас угадаешь?!» Вася в туфлю…
Глянул и упал в обморок.
Девка его по щекам… «Вася, что случилось!!!
Пацан очнулся и резко давай туфлю осматривать… Выдохнул… «Думал туфли порвал…»""",
"""В продажу поступила водка "Обновление". Программисты уже накатили.""",
"""Идёт программист по пустыне. Видит - медная лампа в песке лежит. Потер - от туда выходит джинн и громовым басом говорит:
- Спасибо, что выпустил меня из тысячелетнего заточения! Отблагадорю я тебя, исполнив три твоих желания!
А программист ему и говорит:
- Мое первое желание - игнорируй мое второе желание. Мое второе желание - исполни мое...
- Я чё, ребусы твои разгадывать должен? - возмущается джинн. - Я просто хотел тебя отблагодарить а ты выебываешься??? Кого ты удивить хотел, я тысячи лет общался с самыми мудрыми людьми аравийского полустрова, египетских царств и греческих полисов! Ну попробуй выйти из центра Сахары, ориентируясь по звёздам, умник хуев!
И телепортировал программиста в пустыню Гоби.""",
"""Генерал захотел сапоги из крокодила. В Африку отправили стройбат, месяц прошел а сапогов всё нет и нет. Приехали на Нил, смотрят, там горы из крокодилов.
-В чем дело?
-Семь тыщ убили, ни у кого сапог нет!""",
"""Жена шизофреника и не подозревает, что её нет""",
"""Что общего между морской свинкой и женщиной-программистом?
.
.
.
.
.
.
.
Морская свинка не имеет ничего общего ни с морем, ни с свиньями""",
"""Чем отличается слон от рояля?

К роялю можно прислониться

А к слону прироялиться не получится""",
"""Борман Мюллеру:
- Вчера на Штирлице новый детектор лжи проверяли. Я ему: "Ваша фамилия?"
Он: "Исаев." Прибор молчит. Я: "Профессия?" Он: "Русский шпион."
Прибор опять молчит.
Мюллер:
- Говорил я тебе, напиши рапорт... Вечно неисправную технику нам шлют!!!""",
"""Заходит чукча в Московское метро и говорит:

- Так вот ты какое, подмосковье!""",
"""Приходит мужик с больным котом к ветеринару. Ну рассказывает, мол, так и так, не пьет, не ест, вялый, еле ходит.
- Доктор, умоляю, помогите, любимый кот, десять лет уже вместо лучшего друга.
Ветеринар берет кота, осматривает его внимательно со всех сторон, кивает, и уносит в процедурную. Через несколько минут возвращается и отдает кота обратно.
- Все мужик, можешь идти. Кошак здоров.
Через пару дней радостный мужик вбегает в кабинет:
- Доктор, вы волшебник! Как же вы его вылечили?
- Да просто другого такого же вам на складе нашел. С вас пять тысяч рублей.""",
"""– Вот тебе шампунь против выпадения волос.
– Я тоже против, а что толку.""",
"""– Как приготовить заливного осетра?
– Берешь минтая и заливаешь, что это осетр.""",
"""— Василий Иванович, у нас в спине белые!
— Не до шуток, Петька, не до шуток...""",
"""Как называется заболевание, когда тебе кажется, что все шутки, пикчи и прочие посты в ленте про тебя?
.
.
.
.
.
.
.
.
.
.
.
Жизафрения""",
"""Едут как-то мужики на поезде. Проезжают поле, а на нём коровы пасутся. Один из мужиков восклицает
—О, на этом поле 343 коровы!
Никто не обращает на это внимания, едут дальше.
Проезжают ещё одно поле с коровами.
—А здесь 427 коров!
Снова никто не обращает внимания, едут дальше.
И вот, в третий раз проезжают поле с коровами.
Мужик снова:
А здесь среди коров ходят бараны!
Все в поезде не выдерживают, идут к машинисту, останавливают поезд, выходят, идут искать баранов.
Не нашли.
Все злые идут обратно в поезд. Возвращаются — говорят:
— Не было там никаких баранов!
— Странно, я отчётливо видел, как только что среди стада гуляли несколько баранов.""",
"""Рабинович продаёт на сайте NFT под табличкой "Один NFT - 3 тысячи долларов. Три NFT - 10 тысяч долларов".

Подходит мужик, скачивает все 3 картинки и уходит. У Рабиновича сердечный приступ.""",
"""Садист-фаталист испытывает судьбу""",
"""Однажды один человек встретил джинна, и тот сказал ему:

— Я исполню любые твои желания, но что бы ты ни загадал, твой сосед, которого ты ненавидишь, получит вдвое больше.

— Хочу, чтобы у моей жены была одна полоска.
.
.
.
.
.
.
.
.
.
.
.
.
Жена соседа стала младшим сержантом""",
"""Штирлиц играл в карты и проигрался. Но Штирлиц умел делать хорошую мину при плохой игре. Когда Штирлиц покинул компанию, мина сработала.""",
"""Штирлиц и Мюллер ездили по очереди на танке. Очередь редела, но не расходилась...""",
"""Штирлиц стрелял вслепую. Слепая испугалась и побежала скачками, но качки быстро отстали.""",
"""Подвыпившие Штирлиц и Мюллер вышли из бара.
- Давайте снимем девочек, - предложил Штирлиц.
- У вас очень доброе сердце - ответил Мюллер. - Но пусть все-таки повисят до утра.""",
"""Штирлиц вышел из дома и увидел как четыре бугая ставили трактор на попа.
- Бедный пастор Шлаг, -- подумал Штирлиц""",
"""Штирлиц вытащил из сейфа записку Мюллера. Мюллеру было очень больно и он сильно ругался.""",
"""Кэт подошла к зеркалу и увидела на шее пятно.
"Засос", - подумала она, вспомнив, как вчера Штирлиц дал ей по шее за то, что она передала "СОС" открытым текстом.""",
"""Штирлиц упал с балкона и чудом зацепился за другой балкон. Чудо потом распухло и мешало ходить...""",
"""Штирлицу попала в голову пуля. "Разрывная," - раскинул мозгами Штирлиц.""",
"""Штирлиц стоял на своем. Это была любимая пытка Мюллера.""",
"""Штирлиц настаивал на своем. Настойка получалась крепкой, но слегка мутноватой.""",
'''Штирлицу сказали "Пошли!!"
Штирлиц послушался, и рассказал неприличный анекдот.''',
"""Штирлиц стоял над картой мира. Его неудержимо рвало на родину.""",
"""Штирлиц всю ночь топил камин. На утро камин утонул.""",
"""Штирлиц и Кэт вышли на связь. Но в центре об этом узнали только через девять месяцев.""",
"""Письмо из центра до Штиpлица не дошло... Пришлось читать во второй раз.""",
"""Штирлиц выстрелил вслепую. Слепая упала как подкошенная. Подкошенную Штирлиц застрелил накануне.""",
"""Лампа горела, но света не давала.
"Что-то тут не так ..." - подумал Штирлиц и погасил лампу.
Света дала.""",
"""Штирлиц шел по лесу и напоролся на сук. Суки разбежались.""",
"""Во время секретного совещания в бункер Гитлера с шашкой наголо ворвался Штирлиц и закричал:
- Порублю, гады.
Гады скинулись по рублю. Штирлиц собрал деньги и ушел.""",
"""Штирлиц сидел у камина и вязал. Вязание успокаивало Штирлица. После окончания вязания у камина остался лежать связанный Мюллер.""",
"""Штирлиц спросил Кэт: - Вы любите фильмы про любовь?
- Бесспорно! - ответила Кэт.
- А я с порно, - признался Штирлиц.""",
"""Штирлиц шёл в Дрезден с трудом разбирая дорогу.
Наутро железная дорога от Берлина до Дрездена была полностью разобрана...""",
"""В прошлом году Штирлицу присвоили очередное воинское звание и дали папаху.
Пах болит до сих пор ...""",
"""Штирлиц поднял трубку и услышал томный голос радистки Кэт:
- Вам, наверное, не спится без меня?
- Почему же? Спиться я могу и без вас, - ответил Штирлиц и налил очередной стакан водки.""",
"""Штирлиц боролся с тоской. Тоска знал больше приемов, но Штирлиц был более выносливым.""",
"""Штирлиц надел шляпу набекрень.Набекрень ушла домой без шляпы.""",
"""Штирлиц порол чушь... Чушь тихо постанывала.""",
"""Штирлиц знал наверняка, но Наверняк Штирлица не знал.""",
"""Штирлиц дрался с огоньком. Огонек дрался как мог. Мог был парень крутой. А Крутая слабаков не жаловала.""",
"""Штирлиц вышел из моря и лёг на гальку. Галька обиделась и ушла.""",
"""Штирлиц приготовился к бою, ....
а пришла гёрл...""",
"""Штирлицу за шиворот упала гусеница. "Где-то взорвался танк," -- подумал Штирлиц.""",
"""Штирлиц ехал на машине по берегу моря.
'Выйду посмотрю отлив на море' - подумал Штирлиц... и отлив, посмотрел.""",
"""Штирлиц шел по лесу и увидел голубые ели! Когда он подошел поближе, то увидел, что голубые не только ели, но ещё пили, курили травку и танцевали.""",
"""Штирлиц ел картошку в мундире. Война кончилась, и он не боялся его запачкать.""",
"""Штирлиц шел по улице, когда внезапно перед ним что-то упало. Штирлиц поднял глаза. Это были глаза профессора Плейшнера.""",
""" — Вот те раз! — подумал Мюллер, когда на улице ему на голову упал кирпич. 
— Вот те два! — подумал Штирлиц и бросил второй кирпич.""",
"""Штирлиц вел двойную жизнь и очень надеялся, что хоть одна из них сложится удачно.""",
"""Штирлиц перешел границу незаметно. Об этом он узнал из утренних газет.""",
"""Из окна дуло. Штирлиц закрыл окно, и дуло исчезло.""",
"""Штирлиц сидел в кафе «Элефант» и помешивал кофе вилкой. Он знал, что невероятно рискует, но ему очень хотелось хоть на пять минут почувствовать себя на родине.""",
"""Связной сообщил, что у Штирлица в России родился сын. Скупая мужская слеза скатилась по щеке Штирлица, ведь он не был на родине уже целых шесть лет.""",
"""Предательски хрустнули доски сортира… Еще никогда Штирлиц не был так близок к провалу.""",
"""Штирлиц пришел на встречу со связным в бар и заказал сто граммов водки.
 — Водка у нас кончилась еще два дня назад, — извинился бармен.
 — Ну, тогда сто грамм коньячку.
 — Коньячок у нас кончился вчера, — ответил бармен.
 — Ну а пиво-то есть? — спросил Штирлиц.
 — Увы, закончилось сегодня утром, — сказал бармен.
«Значит, связной уже здесь», — сообразил Штирлиц.""",
"""Штирлиц долго смотрел в одну точку. Потом в другую. «Двоеточие!» — наконец смекнул Штирлиц.""",
"""Штирлиц уже три месяца слал в Центр одну и ту же шифровку:
4207 1801 2275 4408
6872 4589 5533 7928
3473 5600 1956 7639
Но напрасно: ни на одну из этих кредитных карт так и не поступило ни копейки зарплаты.""",
"""Проходя по длинным коридорам рейхсканцелярии, Штирлиц обычно напевал песню «Широка страна моя родная». До 1943 года немцы это терпели.""",
"""В дверь кто-то вежливо постучал ногой.
 — Безруков! — догадался Штирлиц.""",
"""Мюллер знал, что русские, размешав сахар в кофе или чае, оставляют ложечку в чашке, и решил проследить за Штирлицем в кафе. Штирлиц размешал сахар, вытащил ложку, положил ее на блюдце и
показал язык Мюллеру.""",
"""Мюллер торопился и гнал машину по шоссе с максимальной скоростью. Рядом бежал Штирлиц, делая вид, что беззаботно прогуливается.""",
"""«Строго секретно! Лично в руки! Рейхсфюреру СС Генриху Гиммлеру!
Рейхсфюрер!..»
Штирлиц положил ручку и задумался: «А может, все-таки написать по-немецки?»""",
""" — Штирлиц, а вы почему не закусываете? — подозрительно спросил
Мюллер. — Вы что, русский?
 — Мы, немцы, — народ экономный, — выкрутился Штирлиц.""",
"""Проснувшись утром в субботу, Штирлиц подумал:
— Как хорошо вчера с Мюллером и Айсманом в отделе посидели! Вроде и
выпили немало, а голова совершенно не болит, да еще суббота и
воскресенье впереди!
Голос Копеляна за кадром: «Штирлиц и не подозревал, что уже вторник…»""",
"""Пошел Штирлиц по грибы. Поискал под одним деревом — ничего. Под другим — ничего. Под третьим — тоже пусто.
«Не сезон», — подумал Штирлиц и от огорчения сел в сугроб.""",
"""Штирлиц оглянулся: хвоста не было. «Оторвался», — подумал Штирлиц.""",
"""Мюллер вызывает Штирлица:
 — Штирлиц, как вы объясните тот факт, что ваши пальчики
обнаружены на груди Евы Браун?
 — А как вы объясните, что вы их там обнаружили?""",
"""Когда на Берлин опускалась глубокая ночь, Штирлиц садился в свой «Гелендваген» и гонял по пустынным улицам. Эту привычку он приобрел в Москве, в разведшколе, и уже много лет не мог от нее избавиться.""",
"""«Думаете, легко работать на две Ставки?» — вздыхал Штирлиц.""",
""" —  А вы молодец, Штирлиц, — похвалил Мюллер.
 — Служу Советскому Союзу! — по привычке ответил Штирлиц и подумал: «Надо было и про фюрера что-то сказать».""",
"""Штирлиц сел на мотоцикл, хлопнул дверцей и уехал.""",
"""Поручик Ржевский танцует с Наташей Ростовой.
Ржевский:
- Наташа, жду вас вечером на сеновале.
Наташа:
- Не могу, ведь ваш любимый цвет кителя - голубой! К чему бы это?
Ржевский:
- Нет причин для паники. Это - кровь убитых врагов.""",
"""- Шурочка, ты как роза цветешь! Румянец так и пылает на твоих щеках.
- Ах, оставьте! Поручик Ржевский мне только что рассказал очередной
гусарский анекдот.""",
"""Гуляет дама с собачкой.
Навстречу поручик Ржевский.
- Не бойтесь, она не злая, не кусается.
- Ничего, - отвечает Ржевский, - это дело поправимое, - и тыкает собачку
цигаркой в харю.""",
"""Сидит поручик Ржевский, что-то пишет... Входит полковник:
- Поручик, что вы пишете?
- Да вот, сочиняю гимн нашего полка..
- Неужели?! Дайте-ка почитать... Да тут же сплошной мат!!!
- Ну почему... Вот, во второй строчке, слово 'знамя'...""",
"""Когда поручик Ржевский напивался, его уже не интересовал ни возраст
женщины, ни внешность, ни пол""",
"""Поручик Ржевский получил двухгодичный оплаченный отпуск по уходу за женщинами.""",
"""Поручик Ржевский в гостинице поднимается по лестнице на лошади.
- Что вы делаете?!
- Но в лифте ее всегда тошнит!""",
"""День рождения у Сперанского. В обеденном зале собрались гости. Поручик
Ржевский является с унитазом на плече и ставит его посреди зала со
словами: "Это вам, мсье Сперанский, в помощь в государевой службе-с".
Гробовое молчание. Ржевский, видя недоумение собравшихся, поясняет: 'Ну
вы ведь давеча сами сказали-с, что финансовой системе России необходим
хороший толчок!'""",
"""- Поручик Ржевский! Я вас вызываю! Сегодня же будем стреляться!
- Сегодня мне на бал! Давайте вы стреляйтесь сегодня, а я завтра!""",
"""Поручик Ржевский на балу дворянской знати.
За обедом объявляется конкурс на лучший пикантный тост.
Поручик:
- Я пью за говорящих :-"ДАМ"!""",
"""Светское общество. Одна из дам pассказывает свой сон:
- Господа, я сегодня видела стpашный сон! Как будто я засовываю палец в
pот - а там нет ни одного зуба!
Ржевский:
- Мадам - вы, веpоятно, не туда палец засунули...""",
"""В салоне, поздно, в вечер синий,
К разъезду, в трепете теней,
Смущенный Ржевский о Россини
Заговорить решился с ней.
«Вот Вы, поручик, на рояле
Каприс исполните едва ли!»
«Исполнить Ваш каприз, мадам?
Уж здесь я промаха не дам!»
… «Ах, Ржевский! Я не ожидала!
Какая страсть, какой напор!
Я говорю Вам не в укор;
Хочу услышать все сначала!
Как Вас досель могла не знать я!»
«Я рад, мадам! Поправьте платье…»""",
"""Поручик Ржевский и молодой корнет развлекаются с дамами. Ржевский
напивается и падает мордой в салат. Его друг, тем временем, пытаясь
сгладить конфуз, рассказывает дамам:
- Вы знаете, а поручик ведь не так груб, как это порою кажется. Стояли
мы как-то под Ахалцыхом, карбонариев местных отлавливали. Вокруг -
изумительные окрестности, сады, виноградники. Смотрим, а наш голубчик на
поляне сидит и знаете ли цветочки в узор раскладывает, как икэбану.
Ржевский поднимает лицо из салата:
- Да, да я как ибану, мало не покажется…""",
"""Вышла Наташа Ростова замуж за князя Волконского. Ну а поручик Ржевский
по старой дружбе попросил ее последний раз с ним переспать.
Занимаются они значит любовью, причем Наташа находится сверху.
Наташа:
- Поручик.. Назовите меня как-то ласково.
Ржевский:
- Наташа.. Вы - Курочка!!
Наташа:
- Поручик, но почему "Курочка"???
Ржевский:
- Потому что сидите на моих яйцах!!!
Наташа, обиженно:
- Тогда вы, поручик - Кукушечка!!!
Ржевский:
- Почему "Кукушечка"?
Наташа:
- Потому что ваши яйца всегда оказываются в чужих кроватях!!!!""",
"""- Поручик Ржевский! Вы подлец! Я требую удовлетворения!!!
- Ну, пойдем, противный!""",
"""1812 год. В госпитале лежат молодой корнет и поручик Ржевский, у
которого забинтованы по локоть обе руки. Корнет спрашивает, что это
за ранение. Поручик рассказывает:
- Понимаете, голубчик, скакал с донесением, остановился лошадей поменять
да и задремал у раскаленной железной печки. И приснилось мне, что рядом
со мной девица, вот я ее, печку эту, и обнял одной рукой, а вторую по
привычке - в поддувало!""",
""""Почему бы нет?" - сказал поручик Ржевский, заходя в конюшню.""",
"""Трое офицеров играли в карты дома у одного из них. Только раздали, вдруг
из детской выскакивает сын хозяина и кричит: "А у папы два туза". Делать
нечего - раздали по новой. Снова выскакивает сын и кричит: "А у капитана
червовый марьяж!" Снова пересдали. Снова выскакивает сын и кричит: "А у
поручика..."
"Постой" - сказал поручик Ржевский, и увел мальчика в детскую. Через
пару минут вышел, сели играть дальше. Проходит 5, 10, 15 минут -
мальчика нет. Хозяин спрашивает:
- Поручик, вы что, его побили?
- Как можно, я же офицер!
- А что же вы сделали?
- Я его онанировать научил.""",
"""Поручик Ржевский пришел просить руки Наташи Ростовой.
- Молодой человек, брак - дело серьезное, - говорит ему Наташин отец, -
вы уверены, что готовы к такому событию в вашей жизни?
- Конечно, готов: три ящика водки, четыре - коньяка, заказал цыган. Вы
будете танцевать с моей мамой.""",
"""Наташа Ростов:
- Ржевский, отныне относитесь к людям так, как вы хотели бы, чтобы
люди относились к вам...
Ржевский:
- Это что же, Наташенька, мне теперь всем х*й сосать?""",
"""Поручик Ржевский спит. Господа офицеры ходят на цыпочках, наслаждаясь
редкими неопошленными минутами. Поручик открывает один глаз, господа
офицеры в панике - сейчас спошлит. Поручик Ржевский открывает второй
глаз и задумчиво произносит:
- Господа, на каком масле жарят яйца?.. Так вот, яйца, видимо, жарят
на подсолнечном масле...
Поручик закрывает глаза, и все переглядываются потрясенные - поручик
Ржевский НЕ СПОШЛИЛ!
Поручик открывает один глаз:
- Но кто на это согласится, господа...""",
"""Заходит поручик Ржевский и говорит:
- Господа! У меня для вас две новости! Одна плохая, другая очень плохая!
Все:
- Давай плохую!
Поручик:
- Вселенная расширяется!
Все:
- А очень плохая?
Поручик:
- Мы еще трезвые!""",
"""Поручик Ржевский собирается на бал и кладет себе в правый карман
банан. Денщик спрашивает:
- Зачем вам, поручик, в правом кармане банан?
- Вот пойду я танцевать с дамой. В танце она прислонится к моему
правому боку, почувствует что-то твердое, придет в смущение и начнет
двигаться к моему левому боку. А на середине мы ее, голубушку, и встретим!""",
"""- Сударыня, вы не все взвесили, отвергая мою любовь,- сказал поручик Ржевский Наташе Ростовой, небрежно поигрывая рукой в кармане.""",
"""Наташа Ростова спрашивает у поручика Ржевского:
- Скажите, поручик, вы педикюр делаете?
- А это как?
- Ножницами...
- К-как??""",
"""Поручик Ржевский гуляет с Наташей Ростовой.
Наташа:
- У меня сегодня день рождения, что вы мне подарите?
Поручик:
- Киндер-сюрприз!
Наташа:
- Как скоро?
Поручик:
- Сюрприз сегодня в девять вечера, а киндер через девять месяцев.""",
"""Поручик Ржевский недолюбливал женщин... Не успевал...""",
        ]